Documents/ОтменаЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОтменаЗаказовПокупателей</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогСнятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПоручениеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОтменаЗаказовПокупателей/Ext/ObjectModule.bsl
Перем СписП;
Процедура ЗаполнитьЗаказы() Экспорт
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ЗаказыПокупателейОстатки.КоличествоОстаток,
	 |	ЗаказыПокупателейОстатки.ЗаказПокупателя,
	 |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовПриход, 0) КАК Поле1,
	 |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход, 0) КАК Поле2
	 |ИЗ
	 |	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя.ДатаОтгрузки <= &ДатаПроверки) КАК ЗаказыПокупателейОстатки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты КАК ВзаиморасчетыСКонтрагентамиОбороты
	 |		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ВзаиморасчетыСКонтрагентамиОбороты.Сделка";
	 ЗАпрос.УстановитьПараметр("ДатаПроверки",Дата-1*24*60*60);
	 ЗапросРн = Новый Запрос;
	 ЗапросРН.Текст = "ВЫБРАТЬ
	 |	РеализацияТоваровУслуг.Ссылка
	 |ИЗ
	 |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	 |ГДЕ
	 |	РеализацияТоваровУслуг.ПометкаУдаления = Ложь
	 |	И РеализацияТоваровУслуг.Сделка = &Заказ";
	 
	 Рез = ЗАпрос.Выполнить().Выбрать();
	 Заказы.Очистить();
	 Пока Рез.Следующий() Цикл
		 если Рез.ЗаказПокупателя.Статус <> Справочники.Статусы.Создан и ЗначениеЗаполнено(Рез.ЗаказПокупателя.Статус) Тогда
			 Продолжить;
		 КонецеслИ;
		 Если Рез.Поле1 <> 0 или Рез.Поле2 <> 0 Тогда
			 Продолжить;
		 КонецЕсли;
		 ЗапросРН.УстановитьПараметр("Заказ",Рез.ЗаказПокупателя);
		 РезРн = ЗапросРн.Выполнить().Выбрать();
		 ЕстьРН = Ложь;
		 Пока РезРн.Следующий() Цикл
			 ЕстьРН = Истина;
			 Прервать;
		 КонецЦикла;
		 если естьРН Тогда
			 Продолжить;
		 КонецЕсли;
		 ЕстьРезервПоПоставщику = Ложь;
		 Для Каждого СтрТовары Из Рез.ЗаказПокупателя.Товары Цикл
			 Если ТипЗнч(СтрТовары.Размещение) = Тип("ДокументСсылка.ЗаказПокупателя")  Тогда
				 ЕстьРезервПоПоставщику = Истина;
			 КонецЕсли;
		 КонецЦикла;
		 если ЕстьРезервПоПоставщику Тогда
			 Продолжить;
		 КонецЕсли;
		 
		 Ст = Заказы.Добавить();
		 Ст.Заказ = Рез.ЗаказПокупателя;
		 Ст.ДатаОтгрузки = Рез.ЗаказПокупателя.ДатаОтгрузки;
		 Ст.Сумма = Рез.ЗаказПокупателя.СуммаДокумента;
		 Ст.Ответственный = Рез.ЗаказПокупателя.Ответственный;
	 КонецЦикла;
 КонецПроцедуры
 
 Функция ЕстьПеремещение(Зак)
	 Снимаем = 0;
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ПеремещениеТоваров.ВнутреннийЗаказ,
	 |	ПеремещениеТоваров.Ссылка
	 |ИЗ
	 |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	 |ГДЕ
	 |	ПеремещениеТоваров.ПометкаУдаления = Ложь
	 |	И ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ";
	 Запрос.УстановитьПараметр("Заказ",Зак);
	 Рез = Запрос.Выполнить().Выбрать();
	 СписП = Новый СписокЗначений;
	 
	 Пока Рез.Следующий() Цикл
		 Снимаем = Истина;
		 СписП.Добавить(Рез.Ссылка);
	 КонецЦикла;
	 Если СписП.Количество() > 0 или Снимаем = 0 Тогда
		 Снимаем = Истина;
	 Иначе
		 Снимаем = ЛОЖЬ;
	 КонецеслИ;
	 Возврат Снимаем;
 КонецФункции
 
  Функция ЕстьЭкспедиторка(Зак)
	 Снимаем = Истина;
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ПеремещениеТоваров.ВнутреннийЗаказ,
	 |	ПеремещениеТоваров.Ссылка
	 |ИЗ
	 |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	 |ГДЕ
	 |	ПеремещениеТоваров.ПометкаУдаления = Ложь
	 |	И ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ";
	 Запрос.УстановитьПараметр("Заказ",Зак);
	 Рез = Запрос.Выполнить().Выбрать();
	 СписП = Новый СписокЗначений;
	 
	 Пока Рез.Следующий() Цикл
		 Снимаем = Ложь;
		 СписП.Добавить(Рез.Ссылка);
	 КонецЦикла;
	 Возврат Снимаем;
 КонецФункции


 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 ЛогСнятия = "";
	 Для Каждого Строка Из Заказы Цикл
		 Если ЕстьПеремещение(Строка.Заказ) Тогда
			 Зак = Строка.Заказ.Ссылка.ПолучитьОбъект();
			 Зак.Статус = Справочники.Статусы.НайтиПоКоду("000000008");
			 Зак.записать(РежимЗаписиДокумента.ОтменаПроведения);
			 ЛогСнятия = ЛогСнятия + Зак.Ссылка+Символы.ПС;
			 к = 0;
			 Пока К<=СписП.Количество()-1 Цикл
				 Пер = СписП[к].Значение.Ссылка.ПолучитьОбъект();
				 Пер.Статус = Справочники.Статусы.НайтиПоКоду("000000008");
				 Пер.записать(РежимЗаписиДокумента.ОтменаПроведения);
				 К = К + 1;
			 КонецЦикла;
		 КонецЕсли;
		 Если Не ЕстьЭкспедиторка(Строка.Заказ) Тогда
		 КонецЕсли;
		 
	 КонецЦикла;
 КонецПроцедуры
